{
    "name": "dot1qPortVlanTable",
    "type": "table",
    "mib": "Q-BRIDGE-MIB",
    "oid": ".1.3.6.1.2.1.17.7.1.4.5",
    "parent": "dot1qVlan",
    "description": "A table containing per-port control and status information for VLAN configuration in the device.",
    "objects": [
        {
            ".1.3.6.1.2.1.17.1.4.1.1": {
                "name": "dot1dBasePort",
                "datatype": "INTEGER32",
                "columntype": "index",
                "order": "1",
                "description": "The port number of the port for which this entry contains bridge management information.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.17.7.1.4.5.1.1": {
                "name": "dot1qPvid",
                "datatype": "UNSIGNED32",
                "columntype": "column",
                "order": "1",
                "description": "The PVID, the VLAN-ID assigned to untagged frames or Priority-Tagged frames received on this port. The value of this object MUST be retained across reinitializations of the management system.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.17.7.1.4.5.1.2": {
                "name": "dot1qPortAcceptableFrameTypes",
                "datatype": "INTEGER",
                "columntype": "column",
                "order": "2",
                "description": "When this is admitOnlyVlanTagged(2), the device will discard untagged frames or Priority-Tagged frames received on this port. When admitAll(1), untagged frames or Priority-Tagged frames received on this port will be accepted and assigned to a VID based on the PVID and VID Set for this port. This control does not affect VLAN-independent Bridge Protocol Data Unit (BPDU) frames, such as GVRP and Spanning Tree Protocol (STP). It does affect VLAN- dependent BPDU frames, such as GMRP. The value of this object MUST be retained across reinitializations of the management system.",
                "status": "Current",
                "types": [
                    {
                        "1": "admitAll"
                    },
                    {
                        "2": "admitOnlyVlanTagged"
                    }
                ]
            }
        },
        {
            ".1.3.6.1.2.1.17.7.1.4.5.1.3": {
                "name": "dot1qPortIngressFiltering",
                "datatype": "INTEGER",
                "columntype": "column",
                "order": "3",
                "description": "When this is true(1), the device will discard incoming frames for VLANs that do not include this Port in its Member set. When false(2), the port will accept all incoming frames. This control does not affect VLAN-independent BPDU frames, such as GVRP and STP. It does affect VLAN- dependent BPDU frames, such as GMRP. The value of this object MUST be retained across reinitializations of the management system.",
                "status": "Current",
                "types": [
                    {
                        "1": "true"
                    },
                    {
                        "2": "false"
                    }
                ]
            }
        },
        {
            ".1.3.6.1.2.1.17.7.1.4.5.1.4": {
                "name": "dot1qPortGvrpStatus",
                "datatype": "INTEGER",
                "columntype": "column",
                "order": "4",
                "description": "The state of GVRP operation on this port. The value enabled(1) indicates that GVRP is enabled on this port, as long as dot1qGvrpStatus is also enabled for this device. When disabled(2) but dot1qGvrpStatus is still enabled for the device, GVRP is disabled on this port: any GVRP packets received will be silently discarded, and no GVRP registrations will be propagated from other ports. This object affects all GVRP Applicant and Registrar state machines on this port. A transition from disabled(2) to enabled(1) will cause a reset of all GVRP state machines on this port. The value of this object MUST be retained across reinitializations of the management system.",
                "status": "Current",
                "types": [
                    {
                        "1": "enabled"
                    },
                    {
                        "2": "disabled"
                    }
                ]
            }
        },
        {
            ".1.3.6.1.2.1.17.7.1.4.5.1.5": {
                "name": "dot1qPortGvrpFailedRegistrations",
                "datatype": "COUNTER",
                "columntype": "column",
                "order": "5",
                "description": "The total number of failed GVRP registrations, for any reason, on this port.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.17.7.1.4.5.1.6": {
                "name": "dot1qPortGvrpLastPduOrigin",
                "datatype": "OCTETSTR",
                "columntype": "column",
                "order": "6",
                "description": "The Source MAC Address of the last GVRP message received on this port.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.17.7.1.4.5.1.7": {
                "name": "dot1qPortRestrictedVlanRegistration",
                "datatype": "INTEGER",
                "columntype": "column",
                "order": "7",
                "description": "The state of Restricted VLAN Registration on this port. If the value of this control is true(1), then creation of a new dynamic VLAN entry is permitted only if there is a Static VLAN Registration Entry for the VLAN concerned, in which the Registrar Administrative Control value for this port is Normal Registration. The value of this object MUST be retained across reinitializations of the management system.",
                "status": "Current",
                "types": [
                    {
                        "1": "true"
                    },
                    {
                        "2": "false"
                    }
                ]
            }
        }
    ]
}
