{
    "name": "udpEndpointTable",
    "type": "table",
    "mib": "UDP-MIB",
    "oid": ".1.3.6.1.2.1.7.7",
    "parent": "udp",
    "description": "A table containing information about this entity's UDP endpoints on which a local application is currently accepting or sending datagrams. The address type in this table represents the address type used for the communication, irrespective of the higher-layer abstraction. For example, an application using IPv6 'sockets' to communicate via IPv4 between ::ffff:10.0.0.1 and ::ffff:10.0.0.2 would use InetAddressType ipv4(1). Unlike the udpTable in RFC 2013, this table also allows the representation of an application that completely specifies both local and remote addresses and ports. A listening application is represented in three possible ways: 1) An application that is willing to accept both IPv4 and IPv6 datagrams is represented by a udpEndpointLocalAddressType of unknown(0) and a udpEndpointLocalAddress of ''h (a zero-length octet-string). 2) An application that is willing to accept only IPv4 or only IPv6 datagrams is represented by a udpEndpointLocalAddressType of the appropriate address type and a udpEndpointLocalAddress of '0.0.0.0' or '::' respectively. 3) An application that is listening for datagrams only for a specific IP address but from any remote system is represented by a udpEndpointLocalAddressType of the appropriate address type, with udpEndpointLocalAddress specifying the local address. In all cases where the remote is a wildcard, the udpEndpointRemoteAddressType is unknown(0), the udpEndpointRemoteAddress is ''h (a zero-length octet-string), and the udpEndpointRemotePort is 0. If the operating system is demultiplexing UDP packets by remote address and port, or if the application has 'connected' the socket specifying a default remote address and port, the udpEndpointRemote* values should be used to reflect this.",
    "objects": [{
            ".1.3.6.1.2.1.7.7.1.1": {
                "name": "udpEndpointLocalAddressType",
                "datatype": "INTEGER",
                "columntype": "index",
                "order": "1",
                "description": "The address type of udpEndpointLocalAddress. Only IPv4, IPv4z, IPv6, and IPv6z addresses are expected, or unknown(0) if datagrams for all local IP addresses are accepted.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.7.7.1.2": {
                "name": "udpEndpointLocalAddress",
                "datatype": "OCTETSTR",
                "columntype": "index",
                "order": "2",
                "description": "The local IP address for this UDP endpoint. The value of this object can be represented in three possible ways, depending on the characteristics of the listening application: 1. For an application that is willing to accept both IPv4 and IPv6 datagrams, the value of this object must be ''h (a zero-length octet-string), with the value of the corresponding instance of the udpEndpointLocalAddressType object being unknown(0). 2. For an application that is willing to accept only IPv4 or only IPv6 datagrams, the value of this object must be '0.0.0.0' or '::', respectively, while the corresponding instance of the udpEndpointLocalAddressType object represents the appropriate address type. 3. For an application that is listening for data destined only to a specific IP address, the value of this object is the specific IP address for which this node is receiving packets, with the corresponding instance of the udpEndpointLocalAddressType object representing the appropriate address type. As this object is used in the index for the udpEndpointTable, implementors of this table should be careful not to create entries that would result in OIDs with more than 128 subidentifiers; else the information cannot be accessed using SNMPv1, SNMPv2c, or SNMPv3.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.7.7.1.3": {
                "name": "udpEndpointLocalPort",
                "datatype": "UNSIGNED32",
                "columntype": "index",
                "order": "3",
                "description": "The local port number for this UDP endpoint.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.7.7.1.4": {
                "name": "udpEndpointRemoteAddressType",
                "datatype": "INTEGER",
                "columntype": "index",
                "order": "4",
                "description": "The address type of udpEndpointRemoteAddress. Only IPv4, IPv4z, IPv6, and IPv6z addresses are expected, or unknown(0) if datagrams for all remote IP addresses are accepted. Also, note that some combinations of udpEndpointLocalAdressType and udpEndpointRemoteAddressType are not supported. In particular, if the value of this object is not unknown(0), it is expected to always refer to the same IP version as udpEndpointLocalAddressType.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.7.7.1.5": {
                "name": "udpEndpointRemoteAddress",
                "datatype": "OCTETSTR",
                "columntype": "index",
                "order": "5",
                "description": "The remote IP address for this UDP endpoint. If datagrams from any remote system are to be accepted, this value is ''h (a zero-length octet-string). Otherwise, it has the type described by udpEndpointRemoteAddressType and is the address of the remote system from which datagrams are to be accepted (or to which all datagrams will be sent). As this object is used in the index for the udpEndpointTable, implementors of this table should be careful not to create entries that would result in OIDs with more than 128 subidentifiers; else the information cannot be accessed using SNMPv1, SNMPv2c, or SNMPv3.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.7.7.1.6": {
                "name": "udpEndpointRemotePort",
                "datatype": "UNSIGNED32",
                "columntype": "index",
                "order": "6",
                "description": "The remote port number for this UDP endpoint. If datagrams from any remote system are to be accepted, this value is zero.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.7.7.1.7": {
                "name": "udpEndpointInstance",
                "datatype": "UNSIGNED32",
                "columntype": "index",
                "order": "7",
                "description": "The instance of this tuple. This object is used to distinguish among multiple processes 'connected' to the same UDP endpoint. For example, on a system implementing the BSD sockets interface, this would be used to support the SO_REUSEADDR and SO_REUSEPORT socket options.",
                "status": "Current"
            }
        },
        {
            ".1.3.6.1.2.1.7.7.1.8": {
                "name": "udpEndpointProcess",
                "datatype": "UNSIGNED32",
                "columntype": "column",
                "order": "8",
                "description": "The system's process ID for the process associated with this endpoint, or zero if there is no such process. This value is expected to be the same as HOST-RESOURCES-MIB::hrSWRunIndex or SYSAPPL-MIB:: sysApplElmtRunIndex for some row in the appropriate tables.",
                "status": "Current"
            }
        }
    ]
}